# Below is the classification of Chinese market entities, based on the classification 
# regulations of the National Bureau of Statistics of China

COMPANY_SUFFIXES = [
    # 公司制
    "集团股份有限公司", "集团有限责任公司", "集团有限公司", "股份有限公司", 
    "有限责任公司", "有限公司",
    # 合伙企业
    # Opt "普通合伙企业", "特殊普通合伙企业", "有限合伙企业", "合伙企业", "普通合伙", "有限合伙",
    # 非公司企业法人
    "股份合作公司", "股份合作企业", "联营企业",
    # 独资企业
    "个人独资企业",
    # 农民专业合作组织
    "农民专业合作联合社", "农民专业合作社",
    # 个体工商户
    "个体工商户"
]

COMPANY_PREFIXES = [
    # 公司关系
    "控股子公司",
    "全资子公司",
    "参股公司",
    "关联公司",
    "所属公司",
    "下辖公司",
    "附属公司",
    "下属公司",
    "旗下公司",
    "成员公司",
    "成员企业",

    # 企业主体
    "生产企业",
    "制造商",
    "供应商",
    "申请单位",
    "申请企业",
    "中标单位",
    "中标企业",
    "投标单位",
    "投标企业",
    "头部企业",
    "龙头企业",

    # 描述性
    "经营者",
    "经营者为",
    "企业名称",
    "公司名称",
    "单位名称",
    "名称",
    "标称",
]


'''
是否需要：
1. 特殊普通合伙
例如会计师事务所、医师事务所、设计师事务所、税务师事务所等。
特殊的普通合伙企业必须在其企业名称中标明“特殊普通合伙”字样，以区别于普通合伙企业
'''
